{
  "home": "Home",
  "about": "About",
  "skills": "Skills",
  "projects": "Projects",
  "contact": "Contact",
  "hello": "Hello, it's me",
  "name": "Bence Salgói",
  "intro_text": "with a love for creating intuitive and engaging web applications. Explore my portfolio to see some of my latest work!",
  "hungarian_cv": "Hungarian CV",
  "english_cv": "English CV",
  "titles": ["Fullstack Developer", "Software Developer", "Programmer"],
  "about_me_title": "About Me",
  "about_me_1": "I am a Fullstack Developer with a solid foundation in both frontend and backend technologies. My expertise includes HTML5, CSS3, JavaScript, and React for frontend development, and Node.js, Express, and PostgreSQL for backend development.",
  "about_me_2": "I recently completed a Fullstack Developer course at Progmatic Academy Kft., which has further honed my technical skills and prepared me for a successful career in software development. My background includes experience with Agile methodologies, Scrum, and version control using Git and GitHub.",
  "about_me_3": "Fluent in Hungarian and with a working knowledge of English, I am passionate about continuous learning and excited to contribute to innovative projects in the tech industry.",
  "contact_title": "Contact Me",
  "name_placeholder": "Your Name",
  "email_placeholder": "Your Email",
  "message_placeholder": "Your Message",
  "send_button": "Send Message",
  "reach_out_text": "Or reach out via:",
  "success_message": "Message sent successfully!",
  "error_message": "Failed to send message. Please try again later.",
  "view_project": "View Project",
  "my_projects": "My Projects",
  "gg_gaming_title": "GG Gaming",
  "gg_gaming_description": "Discover a wide range of downloadable games in our online shop, offering secure payment options through Barion and PayPal. Whether you're a fan of action, adventure, or strategy games, you'll find something to enjoy. Download your favorite games instantly and start playing today!",
  "kart_kingdom_title": "Kart Kingdom",
  "kart_kingdom_description": "Book your go-karting sessions and shop for related equipment and accessories all in one place. Our platform offers a seamless experience with secure payment options through Barion and PayPal. Enjoy the convenience of online booking and purchasing, along with features like live chat for instant assistance and a product rating system to help you make informed decisions. Whether you're gearing up for your next race or simply looking for quality go-karting gear, we've got you covered!",
  "skills_title": "Skills",
  "frontend": "Frontend",
  "backend": "Backend",
  "tool": "Tools",
  "passion_text": "I am passionate about continuous learning and expanding my skill set. I am eager to explore and master new technologies and tools. My goal is to stay adaptable and proficient in the ever-evolving tech landscape.",
  "interest_text": "With a solid foundation in frontend and backend technologies, I am actively interested in learning and working with additional frameworks and languages such as:",
  "believe_text": "I believe in the importance of staying updated and versatile in the tech industry. If you have any interesting projects or technologies that you think I should explore, feel free to reach out. I am always open to new challenges and opportunities for growth!"
}
