{
  "home": "Főoldal",
  "about": "Rólam",
  "skills": "Készségek",
  "projects": "Projektek",
  "contact": "Kapcsolat",
  "about_me_title": "Rólam",
  "hello": "Szia, én",
  "name": "Salgói Bence",
  "intro_text": "vagyok, aki szeret intuitív és vonzó webalkalmazásokat létrehozni. Nézd meg a portfóliómat, hogy megismerd legújabb munkáimat!",
  "hungarian_cv": "Magyar önéletrajz",
  "english_cv": "Angol önéletrajz",
  "titles": ["Fullstack fejlesztő", "Szoftverfejlesztő", "Programozó"],
  "about_me_1": "Fullstack fejlesztő vagyok, aki szilárd alapokkal rendelkezik mind frontend, mind backend technológiák terén. A szakértelmem magában foglalja a HTML5, CSS3, JavaScript és React használatát a frontend fejlesztésben, valamint a Node.js, Express és PostgreSQL használatát a backend fejlesztésben.",
  "about_me_2": "Nemrég fejeztem be a Fullstack Fejlesztői tanfolyamot a Progmatic Academy Kft.-nél, amely tovább csiszolta technikai képességeimet, és felkészített egy sikeres karrierre a szoftverfejlesztés területén. Korábbi tapasztalataim közé tartozik az agilis módszertanok, Scrum, valamint a verziókezelés Git és GitHub használatával.",
  "about_me_3": "Anyanyelvi szinten beszélek magyarul és angol nyelvtudással is rendelkezem. Szenvedélyesen törekszem a folyamatos tanulásra, és izgatottan várom, hogy hozzájárulhassak innovatív projektekhez a tech iparban.",
  "contact_title": "Kapcsolat",
  "name_placeholder": "Neved",
  "email_placeholder": "Email címed",
  "message_placeholder": "Üzeneted",
  "send_button": "Üzenet küldése",
  "reach_out_text": "Vagy lépj kapcsolatba:",
  "success_message": "Az üzenet sikeresen elküldve!",
  "error_message": "Az üzenet küldése sikertelen. Kérlek, próbáld újra később.",
  "view_project": "Projekt megtekintése",
  "my_projects": "Projektjeim",
  "gg_gaming_title": "GG Gaming",
  "gg_gaming_description": "Fedezze fel online boltunk széles választékát, biztonságos fizetési lehetőségekkel Barionon és PayPalon keresztül. Akár akció-, kaland- vagy stratégiai játékok rajongója, biztosan talál valamit, amit élvezhet. Azonnal letöltheti kedvenc játékait és elkezdheti a játékot még ma!",
  "kart_kingdom_title": "Kart Kingdom",
  "kart_kingdom_description": "Foglalja le gokartozási időpontjait és vásároljon kapcsolódó felszereléseket és kiegészítőket egy helyen. Platformunk zökkenőmentes élményt kínál biztonságos fizetési lehetőségekkel Barionon és PayPalon keresztül. Élvezze az online foglalás és vásárlás kényelmét, valamint az azonnali segítséget nyújtó chatet és a termékrating rendszert, amely segít megalapozott döntéseket hozni. Akár a következő versenyére készül, akár egyszerűen csak kiváló minőségű gokart felszerelést keres, nálunk megtalálja, amire szüksége van!",
  "skills_title": "Készségek",
  "frontend": "Frontend",
  "backend": "Backend",
  "tool": "Tool",
  "passion_text": "Szenvedélyesen érdeklődöm az új technológiák és eszközök elsajátítása iránt, valamint a tudásom folyamatos bővítése iránt. Célom, hogy alkalmazkodóképes és ügyes legyek a folyamatosan fejlődő tech világban.",
  "interest_text": "A frontend és backend technológiákban szerzett szilárd alapokkal aktívan érdeklődöm további keretrendszerek és programozási nyelvek iránt, például:",
  "believe_text": "Fontosnak tartom, hogy naprakész és sokoldalú maradjak a tech iparban. Ha van érdekes projekt vagy technológia, amit érdemes lenne felfedeznem, kérlek, vedd fel velem a kapcsolatot. Mindig nyitott vagyok új kihívásokra és fejlődési lehetőségekre!"
}
